"""元组操作"""
"""Menu(...) tuple()
a[i] count index
len 切片 拆包
"""

# c=()          #定义空元组
# b=tuple()     #定义空元组
# d=("a",)      #定义单个元素的元组必须加逗号
# a=(1,2,3)
# for i in range(3):
#     print(a[i])

# #len,count,index,[]切片  类比字符串

# #拆包
# #直接拆包
# a=(1,2,3)
# o,p,q=a
# print(o,p,q)  #个数必须相同，否则报错
# #可变对象拆包(允许元组元素个数大于接收的变量数)
# tup1=(1,2,3,4,5,6)
# a,b,*c=tup1   #此处c为列表形式，而非和函数一样的元组形式
# print(a,b,c)
# #忽略部分变量直接拆包
# tu1=(1,2,3,4,5)
# _,_,_,_,b=tu1      #推荐使用_表示忽略，实在不肯可以用垃圾变量名，反正都能del，表示忽略的随便取名
# print(a,b)
# #忽略部分变量可变对象拆包
# tu1=(1,2,3,4,5)
# *_,a,b=tu1
# print(a,b)
# a,b,*_=tu1
# print(a,b)